Docs/Reference/Content/images/dependencies/net10.0/d2/alloverit-validation-options.d2
direction: left

aoi: AllOverIt
aoi.alloverit-validation-options: AllOverIt.Validation.Options
microsoft-extensions-options_10-0-9: Microsoft.Extensions.Options\nv10.0.9
microsoft-extensions-dependencyinjection-abstractions_10-0-9: Microsoft.Extensions.DependencyInjection.Abstractions\nv10.0.9
microsoft-extensions-primitives_10-0-9: Microsoft.Extensions.Primitives\nv10.0.9
aoi.alloverit-validation: AllOverIt.Validation
fluentvalidation_12-1-1: FluentValidation\nv12.1.1
aoi.alloverit: AllOverIt
aoi.alloverit-assertion: AllOverIt.Assertion
microsoft-extensions-options_10-0-9 <- aoi.alloverit-validation-options
microsoft-extensions-dependencyinjection-abstractions_10-0-9 <- microsoft-extensions-options_10-0-9
microsoft-extensions-primitives_10-0-9 <- microsoft-extensions-options_10-0-9
aoi.alloverit-validation <- aoi.alloverit-validation-options
fluentvalidation_12-1-1 <- aoi.alloverit-validation
microsoft-extensions-dependencyinjection-abstractions_10-0-9 <- aoi.alloverit-validation
aoi.alloverit <- aoi.alloverit-validation
aoi.alloverit-assertion <- aoi.alloverit
microsoft-extensions-options_10-0-9.style.fill: "#ADD8E6"
microsoft-extensions-options_10-0-9.style.opacity: 0.8
microsoft-extensions-dependencyinjection-abstractions_10-0-9.style.fill: "#ADD8E6"
microsoft-extensions-dependencyinjection-abstractions_10-0-9.style.opacity: 0.8
microsoft-extensions-primitives_10-0-9.style.fill: "#FFEC96"
microsoft-extensions-primitives_10-0-9.style.opacity: 0.8
fluentvalidation_12-1-1.style.fill: "#ADD8E6"
fluentvalidation_12-1-1.style.opacity: 0.8
aoi.style.fill: "#E7EBFC"
aoi.style.opacity: 1
