Docs/Reference/Content/images/dependencies/net8.0/mmd/alloverit-validation-options.mmd
flowchart LR
  alloverit-validation-options["AllOverIt.Validation.Options"]
  microsoft-extensions-options_9-0-17["Microsoft.Extensions.Options<br>v9.0.17"]
  microsoft-extensions-dependencyinjection-abstractions_10-0-9["Microsoft.Extensions.DependencyInjection.Abstractions<br>v10.0.9"]
  microsoft-extensions-primitives_9-0-17["Microsoft.Extensions.Primitives<br>v9.0.17"]
  alloverit-validation["AllOverIt.Validation"]
  fluentvalidation_12-1-1["FluentValidation<br>v12.1.1"]
  alloverit["AllOverIt"]
  alloverit-assertion["AllOverIt.Assertion"]
  alloverit-validation-options --> microsoft-extensions-options_9-0-17
  microsoft-extensions-options_9-0-17 --> microsoft-extensions-dependencyinjection-abstractions_10-0-9
  microsoft-extensions-options_9-0-17 --> microsoft-extensions-primitives_9-0-17
  alloverit-validation-options --> alloverit-validation
  alloverit-validation --> fluentvalidation_12-1-1
  alloverit-validation --> microsoft-extensions-dependencyinjection-abstractions_10-0-9
  alloverit-validation --> alloverit
  alloverit --> alloverit-assertion
  style microsoft-extensions-options_9-0-17 fill:#ADD8E6,opacity:0.8
  style microsoft-extensions-dependencyinjection-abstractions_10-0-9 fill:#ADD8E6,opacity:0.8
  style microsoft-extensions-primitives_9-0-17 fill:#FFEC96,opacity:0.8
  style fluentvalidation_12-1-1 fill:#ADD8E6,opacity:0.8
